GitGriever/Game/Keil_v5/ARM/Boards/Keil/MCB4300/RL/FlashFS/SD_File/GLCD_LPC43xx.c
void GLCD_DrawString (unsigned int x, unsigned int y, unsigned char fi, unsigned char *s) {
  unsigned char c;
  unsigned int  cx = x;

  while (*s) {
    c  = *s++;
    c -= 32;
    switch (fi) {
      case 0:  /* Font 6 x 8 */
        GLCD_DrawChar (cx, y,  6,  8, (unsigned char *)&Font_6x8_h  [c * 8]);
        cx += 6;
        break;
      case 1:  /* Font 16 x 24 */
        GLCD_DrawChar (cx, y, 16, 24, (unsigned char *)&Font_16x24_h[c * 24]);
        cx += 16;
        break;
    }
  }
}


/*******************************************************************************
* Clear given line                                                             *
*   Parameter:      ln:       line number                                      *
*                   fi:       font index (0 = 6x8, 1 = 16x24)                  *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_ClearLn (unsigned int ln, unsigned char fi) {
  unsigned char i;
  unsigned char buf[60];

  switch (fi) {
    case 0:  /* Font 6 x 8 */
      for (i = 0; i < (WIDTH+5)/6; i++)
        buf[i] = ' ';
      buf[i+1] = 0;
      break;
    case 1:  /* Font 16 x 24 */
      for (i = 0; i < (WIDTH+15)/16; i++)
        buf[i] = ' ';
      buf[i+1] = 0;
      break;
  }
  GLCD_DisplayString (ln, 0, fi, buf);
}

/*******************************************************************************
* Draw bargraph                                                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        maximum width of bargraph (in pixels)            *
*                   h:        bargraph height                                  *
*                   val:      value of active bargraph (in 1/1024)             *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Bargraph (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned int val) {
  int i,j;

  val = (val * w) >> 10;                /* Scale value                        */
  for (i = 0; i < h; i++) {
    for (j = 0; j <= w-1; j++) {
     #if (LANDSCAPE == 0)
      if(j >= val) {
        fb[(y+i)*PHYS_XSZ + (x+j)] = Color[BG_COLOR];
      } else {
        fb[(y+i)*PHYS_XSZ + (x+j)] = Color[TXT_COLOR];
      }
     #else
      if(j >= val) {
        fb[(x+j)*PHYS_XSZ + (y+i)] = Color[BG_COLOR];
      } else {
        fb[(x+j)*PHYS_XSZ + (y+i)] = Color[TXT_COLOR];
      }
     #endif
    }
  }
}


/*******************************************************************************
* Display graphical bitmap image at position x horizontally and y vertically   *
* (This function is optimized for 16 bits per pixel format, it has to be       *
*  adapted for any other bits per pixel format)                                *
*   Parameter:      x:        horizontal position                              *
*                   y:        vertical position                                *
*                   w:        width of bitmap                                  *
*                   h:        height of bitmap                                 *
*                   bitmap:   address at which the bitmap data resides         *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_Bitmap (unsigned int x, unsigned int y, unsigned int w, unsigned int h, unsigned char *bitmap) {
  int i, j, ofs;
  unsigned short *bitmap_ptr = (unsigned short *)bitmap;

  for (i = (h-1)*w, ofs = 0; i >= 0; i -= w, ofs++) {    
    for (j = 0; j < w; j++) {
     #if (LANDSCAPE == 0)
      fb[(x+ofs)*PHYS_XSZ + (y+j)] = bitmap_ptr[i+j];
     #else
      fb[(x+j)*PHYS_XSZ + (y+ofs)] = bitmap_ptr[i+j];
     #endif
    }
  }
}



/*******************************************************************************
* Scroll content of the whole display for dy pixels vertically                 *
*   Parameter:      dy:       number of pixels for vertical scroll             *
*   Return:                                                                    *
*******************************************************************************/

void GLCD_ScrollVertical (unsigned int dy) {
#if (LANDSCAPE == 0)
  uint32_t x, y;
  for (y = 0; y < (PHYS_YSZ - dy); y++) {
    for (x = 0; x < PHYS_XSZ; x++) {
      fb[y*PHYS_XSZ + x] = fb[(y+dy)*PHYS_XSZ + x];
    }
  }
  for (; y < PHYS_YSZ; y++) {
    for (x = 0; x < PHYS_XSZ; x++) {
      fb[y*PHYS_XSZ + x] = Color[BG_COLOR];
    }
  }
#endif
}


/*******************************************************************************
* Write a command to the LCD controller                                        *
*   Parameter:      cmd:      command to write to the LCD                      *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_WrCmd (unsigned char cmd) {
  wr_cmd (cmd);
}


/*******************************************************************************
* Write a value into LCD controller register                                   *
*   Parameter:      reg:      lcd register address                             *
*                   val:      value to write into reg                          *
*   Return:                                                                    *
*******************************************************************************/
void GLCD_WrReg (unsigned char reg, unsigned short val) {
  wr_reg (reg, val);
}
/******************************************************************************/
